Задача:
Напишите программу, которая:

Спрашивает имя пользователя.

Выводит: Привет, <имя>!

Цель:
потренироваться в Scanner, String, System.out.println.

2. Средняя задача: Минимум из двух чисел

Задача:
Напишите программу, которая:

Считывает два числа.

Сравнивает их и выводит минимальное.

Цель:
потренироваться в if/else, int, сравнениях.

3. Сложная задача: Проверка логина и пароля

Задача:
Напишите программу, которая:

Задаёт в коде логин и пароль (admin и 1234).

Пользователь вводит свои данные.

Если совпадает → вывести «Доступ разрешён».

Если не совпадает → вывести «Ошибка доступа».

Цель:
потренироваться в if/else, String, сравнении строк (equals).
