
# 📅 Неделя 3 — Классы и объекты  
🎯 **Цель:** познакомиться с ООП-базой — понять, что такое класс, объект, поля, методы, конструкторы и ключевое слово `this`.

---

## 🧭 Общая цель недели
К концу недели ученик:
- понимает отличие **класса** и **объекта**;
- знает, что такое **поля**, **методы экземпляра**, **конструкторы**;
- умеет создавать объекты через `new`;
- использует `this` для обращения к текущему объекту;
- может описать простую сущность (например, `User` или `Book`) и создать объект.

---

## 📖 План обучения на неделю

| День | Тема | Основные понятия | Практика |
|------|------|------------------|-----------|
| **1** | Что такое класс и объект | Отличие класса и объекта. Примеры из жизни. | Создать класс `Car` с полями (модель, цвет) и создать несколько объектов. |
| **2** | Поля и методы экземпляра | Как объявляются поля (состояние) и методы (поведение). Разница между статическими и экземплярными методами. | Добавить в `Car` методы: `start()`, `stop()`, `printInfo()`. |
| **3** | Конструкторы | Что такое конструктор, зачем нужен. Отличие от обычных методов. | Добавить конструктор в `Car`, который задаёт поля при создании. |
| **4** | Ключевые слова `this` и `new` | Как работает `new`, зачем нужен `this`. | Переписать методы `Car`, используя `this`. |
| **5** | Класс `User` или `Book` — собственный проект | Создание своего класса с полями и методами. | Реализовать `User` (имя, возраст, email) или `Book` (название, автор, год). |
| **6** | Работа с несколькими объектами | Массивы объектов, вызовы методов у каждого. | Создать массив из 3–5 объектов `Book` и вывести информацию о всех. |
| **7** | Итог недели + мини-проект | Подведение итогов. | Написать программу, которая создаёт и выводит список пользователей или книг. |

---

## 📚 Теоретические блоки

### 🧩 День 1. Класс и объект
- Класс — **чертёж**, описывающий, какие данные и действия есть у объекта.  
- Объект — **реальный экземпляр** класса.  
- Пример:
  ```java
  class Car {
      String model;
      String color;
  }

  public class Main {
      public static void main(String[] args) {
          Car car1 = new Car();  // создаём объект
          car1.model = "BMW";
          car1.color = "Black";
          System.out.println(car1.model + " - " + car1.color);
      }
  }
  ```

---

### 🧩 День 2. Поля и методы экземпляра
- Поля → описывают состояние объекта.  
- Методы → описывают поведение.  
- Пример:
  ```java
  class Car {
      String model;
      String color;

      void start() {
          System.out.println(model + " поехала!");
      }

      void stop() {
          System.out.println(model + " остановилась.");
      }

      void printInfo() {
          System.out.println("Модель: " + model + ", цвет: " + color);
      }
  }
  ```

---

### 🧩 День 3. Конструкторы
- Конструктор вызывается при создании объекта (`new Car(...)`).  
- У него **то же имя**, что и у класса.  
- Пример:
  ```java
  class Car {
      String model;
      String color;

      Car(String model, String color) {
          this.model = model;
          this.color = color;
      }
  }

  public class Main {
      public static void main(String[] args) {
          Car car1 = new Car("Toyota", "Red");
          Car car2 = new Car("BMW", "Black");
      }
  }
  ```

---

### 🧩 День 4. `this` и `new`
- `new` создаёт объект и вызывает конструктор.  
- `this` указывает на текущий объект.  
- Пример:
  ```java
  class Car {
      String model;
      String color;

      Car(String model, String color) {
          this.model = model;
          this.color = color;
      }

      void repaint(String newColor) {
          this.color = newColor;
      }
  }
  ```

---

### 🧩 День 5. Практика — свой класс
Создай класс **User** или **Book**.  
Пример:
```java
class User {
    String name;
    int age;
    String email;

    User(String name, int age, String email) {
        this.name = name;
        this.age = age;
        this.email = email;
    }

    void printInfo() {
        System.out.println(name + " (" + age + "), email: " + email);
    }
}
```

---

### 🧩 День 6. Массивы объектов
Пример:
```java
public class Main {
    public static void main(String[] args) {
        Book[] books = {
            new Book("1984", "George Orwell", 1949),
            new Book("Brave New World", "Aldous Huxley", 1932),
            new Book("Fahrenheit 451", "Ray Bradbury", 1953)
        };

        for (Book b : books) {
            b.printInfo();
        }
    }
}
```

---

### 🧩 День 7. Итог недели (мини-проект)
Напиши программу, которая:
1. Создаёт класс `Book` или `User`.  
2. Добавляет 3–5 объектов в массив.  
3. Выводит информацию о каждом.  
4. Добавь минимум 1 метод, который **меняет состояние** объекта (например, `updateEmail` или `changeAuthor`).  

---

## 📌 Итог недели

✅ Понимает:  
- отличие **класса** и **объекта**;  
- что такое **поля**, **методы экземпляра** и **конструкторы**;  
- как работает `this` и `new`.  

💡 Умеет:  
- описывать сущности через классы;  
- создавать объекты;  
- вызывать методы и изменять состояние объекта;  
- работать с массивом объектов.
